perf_test/results/recommend_empty_1000_RPS.txt
Requests      [total, rate, throughput]         60000, 999.62, 820.90
Duration      [total, attack, wait]             1m12s, 1m0s, 11.681s
Latencies     [min, mean, 50, 90, 95, 99, max]  509.3µs, 645.296ms, 3.442ms, 390.567ms, 575.229ms, 30.003s, 30.032s
Bytes In      [total, mean]                     114486590, 1908.11
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           98.10%
Status Codes  [code:count]                      0:1138  200:58862  
Error Set:
Get "http://localhost:8085/api/v0/recommend/home?limit=10": EOF
Get "http://localhost:8085/api/v0/recommend/home?limit=10": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57741->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57739->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57749->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57747->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57748->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:57746->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:58022->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:58068->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:58101->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:58102->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:58179->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:62012->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61493->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61500->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61499->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61503->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61498->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61521->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61523->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61522->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61516->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61543->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61542->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61540->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61544->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61563->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61558->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61557->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61556->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61560->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61562->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61561->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61559->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61586->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61591->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61595->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61588->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61590->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61589->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61594->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61608->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61602->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61605->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61604->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61606->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61625->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61618->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61614->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61624->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61616->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61621->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61612->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61613->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61665->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61669->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61667->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61664->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61663->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61696->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61689->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61691->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61686->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61695->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61687->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61685->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61684->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61682->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61690->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61699->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61697->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61701->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61683->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61693->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61694->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8085/api/v0/recommend/home?limit=10": read tcp [::1]:61702->[::1]:8085: wsarecv: An existing connection was forcibly closed by the remote host. (Client.Timeout exceeded while awaiting headers)